####################################################################################
#
# Generated by eda_pt_script.tcl	#1
#              eda_pt_generate.tcl	#1
#              in d:/altera/91sp2/quartus/common/tcl/internal/eda_pt/.
#
# Quartus:  Version 9.1 Build 350 03/24/2010 Service Pack 2 SJ Web Edition
#
# Project:  Microwave
# Revision: Microwave
# Device:   EP3C5E144C8
#
# Date: Tue Dec 25 14:09:19 CST 2018
#
# Copyright (C) 1991-2010 Altera Corporation
#
####################################################################################


##################
# Header Section #
##################

# This Tcl script should be used for PrimeTime (Verilog) only
set report_default_significant_digits 3
set hierarchy_separator .
set quartus_root "d:/altera/91sp2/quartus/"
set search_path [list . [format "%s%s" $quartus_root "eda/synopsys/primetime/lib"] ]
set link_path [list * cycloneiii_atoms.db bb2_lib.db  alt_vtl.db]
read_verilog cycloneiii_all_pt.v


########################
# Design Entry Section #
########################

read_verilog microwave.vo
current_design Microwave
link
set_operating_conditions -analysis_type on_chip_variation
## Use "slow" for slow corner or "fast" for fast corner
set corner slow
if [string equal -nocase $corner slow] {
	read_sdf -analysis_type on_chip_variation microwave_v.sdo
} elseif [string equal -nocase $corner fast] {
	read_sdf -analysis_type on_chip_variation microwave_v_fast.sdo
}
## To remove clock reconvergence pessimism, uncomment the following line:
## set timing_remove_clock_reconvergence_pessimism true


######################
# Timing Constraints #
######################

source Microwave.collections.sdc
source Microwave.constraints.sdc

########################
# Output Pins Loadings #
########################

# Pin A[0] ( Location = 50 )
set_load -pin_load 0 [get_ports { {A[0]} } ]
# Pin A[1] ( Location = 51 )
set_load -pin_load 0 [get_ports { {A[1]} } ]
# Pin A[2] ( Location = 52 )
set_load -pin_load 0 [get_ports { {A[2]} } ]
# Pin A[3] ( Location = 53 )
set_load -pin_load 0 [get_ports { {A[3]} } ]
# Pin B[0] ( Location = 54 )
set_load -pin_load 0 [get_ports { {B[0]} } ]
# Pin B[1] ( Location = 55 )
set_load -pin_load 0 [get_ports { {B[1]} } ]
# Pin B[2] ( Location = 58 )
set_load -pin_load 0 [get_ports { {B[2]} } ]
# Pin B[3] ( Location = 59 )
set_load -pin_load 0 [get_ports { {B[3]} } ]
# Pin C[0] ( Location = 60 )
set_load -pin_load 0 [get_ports { {C[0]} } ]
# Pin C[1] ( Location = 64 )
set_load -pin_load 0 [get_ports { {C[1]} } ]
# Pin C[2] ( Location = 65 )
set_load -pin_load 0 [get_ports { {C[2]} } ]
# Pin C[3] ( Location = 66 )
set_load -pin_load 0 [get_ports { {C[3]} } ]
# Pin Col[0] ( Location = 3 )
set_load -pin_load 0 [get_ports { {Col[0]} } ]
# Pin Col[1] ( Location = 4 )
set_load -pin_load 0 [get_ports { {Col[1]} } ]
# Pin Col[2] ( Location = 7 )
set_load -pin_load 0 [get_ports { {Col[2]} } ]
# Pin Col[3] ( Location = 2 )
set_load -pin_load 0 [get_ports { {Col[3]} } ]
# Pin DDLight ( Location = 43 )
set_load -pin_load 0 [get_ports { DDLight } ]
# Pin D[0] ( Location = 67 )
set_load -pin_load 0 [get_ports { {D[0]} } ]
# Pin D[1] ( Location = 68 )
set_load -pin_load 0 [get_ports { {D[1]} } ]
# Pin D[2] ( Location = 69 )
set_load -pin_load 0 [get_ports { {D[2]} } ]
# Pin D[3] ( Location = 70 )
set_load -pin_load 0 [get_ports { {D[3]} } ]
# Pin FireLit[0] ( Location = 77 )
set_load -pin_load 0 [get_ports { {FireLit[0]} } ]
# Pin FireLit[1] ( Location = 76 )
set_load -pin_load 0 [get_ports { {FireLit[1]} } ]
# Pin FireLit[2] ( Location = 75 )
set_load -pin_load 0 [get_ports { {FireLit[2]} } ]
# Pin FireLit[3] ( Location = 74 )
set_load -pin_load 0 [get_ports { {FireLit[3]} } ]
# Pin FireLit[4] ( Location = 73 )
set_load -pin_load 0 [get_ports { {FireLit[4]} } ]
# Pin FireLit[5] ( Location = 72 )
set_load -pin_load 0 [get_ports { {FireLit[5]} } ]
# Pin FireLit[6] ( Location = 71 )
set_load -pin_load 0 [get_ports { {FireLit[6]} } ]
# Pin FireLit[7] ( Location = 49 )
set_load -pin_load 0 [get_ports { {FireLit[7]} } ]
# Pin FireLit[8] ( Location = 46 )
set_load -pin_load 0 [get_ports { {FireLit[8]} } ]
# Pin FireLit[9] ( Location = 44 )
set_load -pin_load 0 [get_ports { {FireLit[9]} } ]
# Pin OpenLit ( Location = 79 )
set_load -pin_load 0 [get_ports { OpenLit } ]
# Pin WarningLit ( Location = 85 )
set_load -pin_load 0 [get_ports { WarningLit } ]
